import { ScheduleLesson } from "./ScheduleLessonComponent"


export const ScheduleComponent = () => {

  const lessons = [
    {
      "group": "1101",
      "subject": "Начертательная геометрия и инженерная графика",
      "teacher": "ХАЛУЕВА ВЕРА ВЛАДИСЛАВОВНА",
      "building": "2",
      "room": "514",
      "dates": [
        "07.09",
        "14.09",
        "21.09",
        "28.09",
        "05.10",
        "12.10",
        "19.10",
        "26.10",
        "02.11",
        "09.11",
        "16.11",
        "23.11",
        "30.11",
        "07.12",
        "14.12",
        "21.12"
      ],
      "time": "08:00",
      "departament": "Кафедра машиноведения и инженерной графики",
      "type": "lab",
      "stream": false
    },
    {
      "group": "1101",
      "subject": "Начертательная геометрия и инженерная графика",
      "teacher": "ХАЛУЕВА ВЕРА ВЛАДИСЛАВОВНА",
      "building": "2",
      "room": "514",
      "dates": [
        "07.09",
        "14.09",
        "21.09",
        "28.09",
        "05.10",
        "12.10",
        "19.10",
        "26.10",
        "02.11",
        "09.11",
        "16.11",
        "23.11",
        "30.11",
        "07.12",
        "14.12",
        "21.12"
      ],
      "time": "09:40",
      "departament": "Кафедра машиноведения и инженерной графики",
      "type": "lab",
      "stream": false
    },
    {
      "group": "1101",
      "subject": "Высшая математика",
      "teacher": "БИЛЬЧЕНКО НАТАЛЬЯ ГРИГОРЬЕВНА",
      "building": "2",
      "room": "202",
      "dates": [
        "07.09",
        "14.09",
        "21.09",
        "28.09",
        "05.10",
        "12.10",
        "19.10",
        "26.10",
        "02.11",
        "09.11",
        "16.11",
        "23.11",
        "30.11",
        "07.12",
        "14.12",
        "21.12"
      ],
      "time": "11:20",
      "departament": "Кафедра теоретической и прикладной механики и математики",
      "type": "lec",
      "stream": false
    },
    {
      "group": "1101",
      "subject": "Физика",
      "teacher": "ЦАРЕВА АЛЬБИНА МАРАТОВНА",
      "building": "2",
      "room": "актовый зал",
      "dates": [
        "07.09",
        "14.09",
        "21.09",
        "28.09",
        "05.10",
        "12.10",
        "19.10",
        "26.10",
        "02.11",
        "09.11",
        "16.11",
        "23.11",
        "30.11",
        "07.12",
        "14.12",
        "21.12"
      ],
      "time": "13:30",
      "departament": "Кафедра технической физики",
      "type": "lec",
      "stream": false
    },
    {
      "group": "1101",
      "subject": "Основы российской государственности",
      "teacher": "СОЛОДУХО МАРГАРИТА НАТАНОВНА",
      "building": "8",
      "room": "406",
      "dates": [
        "07.09",
        "21.09",
        "05.10",
        "19.10",
        "02.11",
        "16.11",
        "30.11",
        "14.12"
      ],
      "time": "15:10",
      "departament": "Кафедра философии",
      "type": "lec",
      "stream": false
    }
  ]

  return (
    <div className="schedule">
      {lessons.map((lesson, i) => (
        <div key={i}>
          <ScheduleLesson lesson={lesson} />
        </div>
      ))}
    </div>
  )
}